
var dataList = [
    { "job_name": "精算", "job_duty": "1) 接收客户线上需求，并根据业务流程要求为客户提供解决方案 <br>2) 跟进/监控个案的后续发展，确保客户同步得到处理结果 <br>3) 处理客户抱怨或投诉，并按流程要求进行个案升级，安抚客户 <br>4) 分析问题， 解决问题", "job_num": "本科及以上；", "job_need": "1、全日制本科及以上学历，精算、统计、数学、金融、保险等相关专业优先；<br> 2、具备良好的人际沟通、组织协调能力和团队合作精神；<br>3、具备较强的责任感、上进心与抗压力；<br>4、具有创新意识与能力", "job_address": "深圳市" },
    { "job_name": "风险管理", "job_duty": "1) 接收客户线上需求，并根据业务流程要求为客户提供解决方案 <br>2) 跟进/监控个案的后续发展，确保客户同步得到处理结果 <br>3) 处理客户抱怨或投诉，并按流程要求进行个案升级，安抚客户 <br>4) 分析问题， 解决问题", "job_num": "本科及以上；", "job_need": "1、全日制本科及以上学历，精算、统计、数学、金融、保险等相关专业优先；<br> 2、具备良好的人际沟通、组织协调能力和团队合作精神；<br>3、具备较强的责任感、上进心与抗压力；<br>5、具有创新意识与能力", "job_address": "深圳市" },
    { "job_name": "市场研究", "job_duty": "1) 接收客户线上需求，并根据业务流程要求为客户提供解决方案 <br>2) 跟进/监控个案的后续发展，确保客户同步得到处理结果 <br>3) 处理客户抱怨或投诉，并按流程要求进行个案升级，安抚客户 <br>4) 分析问题， 解决问题", "job_num": "本科及以上；", "job_need": "1、全日制本科及以上学历，精算、统计、数学、金融、保险等相关专业优先；<br> 2、具备良好的人际沟通、组织协调能力和团队合作精神；<br>3、具备较强的责任感、上进心与抗压力；<br>6、具有创新意识与能力", "job_address": "深圳市" },
    { "job_name": "投资管理", "job_duty": "1) 接收客户线上需求，并根据业务流程要求为客户提供解决方案 <br>2) 跟进/监控个案的后续发展，确保客户同步得到处理结果 <br>3) 处理客户抱怨或投诉，并按流程要求进行个案升级，安抚客户 <br>4) 分析问题， 解决问题", "job_num": "本科及以上；", "job_need": "1、全日制本科及以上学历，精算、统计、数学、金融、保险等相关专业优先；<br> 2、具备良好的人际沟通、组织协调能力和团队合作精神；<br>3、具备较强的责任感、上进心与抗压力；<br>7、具有创新意识与能力", "job_address": "深圳市" },
    { "job_name": "再保管理", "job_duty": "1) 接收客户线上需求，并根据业务流程要求为客户提供解决方案 <br>2) 跟进/监控个案的后续发展，确保客户同步得到处理结果 <br>3) 处理客户抱怨或投诉，并按流程要求进行个案升级，安抚客户 <br>4) 分析问题， 解决问题", "job_num": "本科及以上；", "job_need": "1、全日制本科及以上学历，精算、统计、数学、金融、保险等相关专业优先；<br> 2、具备良好的人际沟通、组织协调能力和团队合作精神；<br>3、具备较强的责任感、上进心与抗压力；<br>8、具有创新意识与能力", "job_address": "深圳市" },
    { "job_name": "审计", "job_duty": "1) 接收客户线上需求，并根据业务流程要求为客户提供解决方案 <br>2) 跟进/监控个案的后续发展，确保客户同步得到处理结果 <br>3) 处理客户抱怨或投诉，并按流程要求进行个案升级，安抚客户 <br>4) 分析问题， 解决问题", "job_num": "本科及以上；", "job_need": "1、全日制本科及以上学历，精算、统计、数学、金融、保险等相关专业优先；<br> 2、具备良好的人际沟通、组织协调能力和团队合作精神；<br>3、具备较强的责任感、上进心与抗压力；<br>9、具有创新意识与能力", "job_address": "深圳市" },
    { "job_name": "合规法务", "job_duty": "1) 接收客户线上需求，并根据业务流程要求为客户提供解决方案 <br>2) 跟进/监控个案的后续发展，确保客户同步得到处理结果 <br>3) 处理客户抱怨或投诉，并按流程要求进行个案升级，安抚客户 <br>4) 分析问题， 解决问题", "job_num": "本科及以上；", "job_need": "1、全日制本科及以上学历，精算、统计、数学、金融、保险等相关专业优先；<br> 2、具备良好的人际沟通、组织协调能力和团队合作精神；<br>3、具备较强的责任感、上进心与抗压力；<br>10、具有创新意识与能力", "job_address": "深圳市" },
    { "job_name": "统计分析", "job_duty": "1) 接收客户线上需求，并根据业务流程要求为客户提供解决方案 <br>2) 跟进/监控个案的后续发展，确保客户同步得到处理结果 <br>3) 处理客户抱怨或投诉，并按流程要求进行个案升级，安抚客户 <br>4) 分析问题， 解决问题", "job_num": "本科及以上；", "job_need": "1、全日制本科及以上学历，精算、统计、数学、金融、保险等相关专业优先；<br> 2、具备良好的人际沟通、组织协调能力和团队合作精神；<br>3、具备较强的责任感、上进心与抗压力；<br>11、具有创新意识与能力", "job_address": "深圳市" },
    { "job_name": "市场营销", "job_duty": "1) 接收客户线上需求，并根据业务流程要求为客户提供解决方案 <br>2) 跟进/监控个案的后续发展，确保客户同步得到处理结果 <br>3) 处理客户抱怨或投诉，并按流程要求进行个案升级，安抚客户 <br>4) 分析问题， 解决问题", "job_num": "本科及以上；", "job_need": "1、全日制本科及以上学历，精算、统计、数学、金融、保险等相关专业优先；<br> 2、具备良好的人际沟通、组织协调能力和团队合作精神；<br>3、具备较强的责任感、上进心与抗压力；<br>12、具有创新意识与能力", "job_address": "深圳市" },
    { "job_name": "电子商务", "job_duty": "1) 接收客户线上需求，并根据业务流程要求为客户提供解决方案 <br>2) 跟进/监控个案的后续发展，确保客户同步得到处理结果 <br>3) 处理客户抱怨或投诉，并按流程要求进行个案升级，安抚客户 <br>4) 分析问题， 解决问题", "job_num": "本科及以上；", "job_need": "1、全日制本科及以上学历，精算、统计、数学、金融、保险等相关专业优先；<br> 2、具备良好的人际沟通、组织协调能力和团队合作精神；<br>3、具备较强的责任感、上进心与抗压力；<br>13、具有创新意识与能力", "job_address": "深圳市" },
    { "job_name": "核赔管理", "job_duty": "1) 接收客户线上需求，并根据业务流程要求为客户提供解决方案 <br>2) 跟进/监控个案的后续发展，确保客户同步得到处理结果 <br>3) 处理客户抱怨或投诉，并按流程要求进行个案升级，安抚客户 <br>4) 分析问题， 解决问题", "job_num": "本科及以上；", "job_need": "1、全日制本科及以上学历，精算、统计、数学、金融、保险等相关专业优先；<br> 2、具备良好的人际沟通、组织协调能力和团队合作精神；<br>3、具备较强的责任感、上进心与抗压力；<br>14、具有创新意识与能力", "job_address": "深圳市" },
    { "job_name": "核保管理1", "job_duty": "1) 接收客户线上需求，并根据业务流程要求为客户提供解决方案 <br>2) 跟进/监控个案的后续发展，确保客户同步得到处理结果 <br>3) 处理客户抱怨或投诉，并按流程要求进行个案升级，安抚客户 <br>4) 分析问题， 解决问题", "job_num": "本科及以上；", "job_need": "1、全日制本科及以上学历，精算、统计、数学、金融、保险等相关专业优先；<br> 2、具备良好的人际沟通、组织协调能力和团队合作精神；<br>3、具备较强的责任感、上进心与抗压力；<br>15、具有创新意识与能力", "job_address": "深圳市" },
    { "job_name": "核保管理2", "job_duty": "1) 接收客户线上需求，并根据业务流程要求为客户提供解决方案 <br>2) 跟进/监控个案的后续发展，确保客户同步得到处理结果 <br>3) 处理客户抱怨或投诉，并按流程要求进行个案升级，安抚客户 <br>4) 分析问题， 解决问题", "job_num": "本科及以上；", "job_need": "1、全日制本科及以上学历，精算、统计、数学、金融、保险等相关专业优先；<br> 2、具备良好的人际沟通、组织协调能力和团队合作精神；<br>3、具备较强的责任感、上进心与抗压力；<br>16、具有创新意识与能力", "job_address": "深圳市" },
    { "job_name": "核保管理3", "job_duty": "1) 接收客户线上需求，并根据业务流程要求为客户提供解决方案 <br>2) 跟进/监控个案的后续发展，确保客户同步得到处理结果 <br>3) 处理客户抱怨或投诉，并按流程要求进行个案升级，安抚客户 <br>4) 分析问题， 解决问题", "job_num": "本科及以上；", "job_need": "1、全日制本科及以上学历，精算、统计、数学、金融、保险等相关专业优先；<br> 2、具备良好的人际沟通、组织协调能力和团队合作精神；<br>3、具备较强的责任感、上进心与抗压力；<br>17、具有创新意识与能力", "job_address": "深圳市" },
    { "job_name": "核保管理4", "job_duty": "1) 接收客户线上需求，并根据业务流程要求为客户提供解决方案 <br>2) 跟进/监控个案的后续发展，确保客户同步得到处理结果 <br>3) 处理客户抱怨或投诉，并按流程要求进行个案升级，安抚客户 <br>4) 分析问题， 解决问题", "job_num": "本科及以上；", "job_need": "1、全日制本科及以上学历，精算、统计、数学、金融、保险等相关专业优先；<br> 2、具备良好的人际沟通、组织协调能力和团队合作精神；<br>3、具备较强的责任感、上进心与抗压力；<br>18、具有创新意识与能力", "job_address": "深圳市" },
    { "job_name": "核保管理5", "job_duty": "1) 接收客户线上需求，并根据业务流程要求为客户提供解决方案 <br>2) 跟进/监控个案的后续发展，确保客户同步得到处理结果 <br>3) 处理客户抱怨或投诉，并按流程要求进行个案升级，安抚客户 <br>4) 分析问题， 解决问题", "job_num": "本科及以上；", "job_need": "1、全日制本科及以上学历，精算、统计、数学、金融、保险等相关专业优先；<br> 2、具备良好的人际沟通、组织协调能力和团队合作精神；<br>3、具备较强的责任感、上进心与抗压力；<br>19、具有创新意识与能力", "job_address": "深圳市" },
    { "job_name": "核保管理6", "job_duty": "1) 接收客户线上需求，并根据业务流程要求为客户提供解决方案 <br>2) 跟进/监控个案的后续发展，确保客户同步得到处理结果 <br>3) 处理客户抱怨或投诉，并按流程要求进行个案升级，安抚客户 <br>4) 分析问题， 解决问题", "job_num": "本科及以上；", "job_need": "1、全日制本科及以上学历，精算、统计、数学、金融、保险等相关专业优先；<br> 2、具备良好的人际沟通、组织协调能力和团队合作精神；<br>3、具备较强的责任感、上进心与抗压力；<br>20、具有创新意识与能力", "job_address": "深圳市" },
    { "job_name": "核保管理7", "job_duty": "1) 接收客户线上需求，并根据业务流程要求为客户提供解决方案 <br>2) 跟进/监控个案的后续发展，确保客户同步得到处理结果 <br>3) 处理客户抱怨或投诉，并按流程要求进行个案升级，安抚客户 <br>4) 分析问题， 解决问题", "job_num": "本科及以上；", "job_need": "1、全日制本科及以上学历，精算、统计、数学、金融、保险等相关专业优先；<br> 2、具备良好的人际沟通、组织协调能力和团队合作精神；<br>3、具备较强的责任感、上进心与抗压力；<br>21、具有创新意识与能力", "job_address": "深圳市" },
    { "job_name": "核保管理8", "job_duty": "1) 接收客户线上需求，并根据业务流程要求为客户提供解决方案 <br>2) 跟进/监控个案的后续发展，确保客户同步得到处理结果 <br>3) 处理客户抱怨或投诉，并按流程要求进行个案升级，安抚客户 <br>4) 分析问题， 解决问题", "job_num": "本科及以上；", "job_need": "1、全日制本科及以上学历，精算、统计、数学、金融、保险等相关专业优先；<br> 2、具备良好的人际沟通、组织协调能力和团队合作精神；<br>3、具备较强的责任感、上进心与抗压力；<br>22、具有创新意识与能力", "job_address": "深圳市" },
    { "job_name": "核保管理9", "job_duty": "1) 接收客户线上需求，并根据业务流程要求为客户提供解决方案 <br>2) 跟进/监控个案的后续发展，确保客户同步得到处理结果 <br>3) 处理客户抱怨或投诉，并按流程要求进行个案升级，安抚客户 <br>4) 分析问题， 解决问题", "job_num": "本科及以上；", "job_need": "1、全日制本科及以上学历，精算、统计、数学、金融、保险等相关专业优先；<br> 2、具备良好的人际沟通、组织协调能力和团队合作精神；<br>3、具备较强的责任感、上进心与抗压力；<br>23、具有创新意识与能力", "job_address": "深圳市" },
    { "job_name": "核保管理10", "job_duty": "1) 接收客户线上需求，并根据业务流程要求为客户提供解决方案 <br>2) 跟进/监控个案的后续发展，确保客户同步得到处理结果 <br>3) 处理客户抱怨或投诉，并按流程要求进行个案升级，安抚客户 <br>4) 分析问题， 解决问题", "job_num": "本科及以上；", "job_need": "1、全日制本科及以上学历，精算、统计、数学、金融、保险等相关专业优先；<br> 2、具备良好的人际沟通、组织协调能力和团队合作精神；<br>3、具备较强的责任感、上进心与抗压力；<br>24、具有创新意识与能力", "job_address": "深圳市" },
    { "job_name": "核保管理11", "job_duty": "1) 接收客户线上需求，并根据业务流程要求为客户提供解决方案 <br>2) 跟进/监控个案的后续发展，确保客户同步得到处理结果 <br>3) 处理客户抱怨或投诉，并按流程要求进行个案升级，安抚客户 <br>4) 分析问题， 解决问题", "job_num": "本科及以上；", "job_need": "1、全日制本科及以上学历，精算、统计、数学、金融、保险等相关专业优先；<br> 2、具备良好的人际沟通、组织协调能力和团队合作精神；<br>3、具备较强的责任感、上进心与抗压力；<br>25、具有创新意识与能力", "job_address": "深圳市" },
    { "job_name": "核保管理12", "job_duty": "1) 接收客户线上需求，并根据业务流程要求为客户提供解决方案 <br>2) 跟进/监控个案的后续发展，确保客户同步得到处理结果 <br>3) 处理客户抱怨或投诉，并按流程要求进行个案升级，安抚客户 <br>4) 分析问题， 解决问题", "job_num": "本科及以上；", "job_need": "1、全日制本科及以上学历，精算、统计、数学、金融、保险等相关专业优先；<br> 2、具备良好的人际沟通、组织协调能力和团队合作精神；<br>3、具备较强的责任感、上进心与抗压力；<br>26、具有创新意识与能力", "job_address": "深圳市" },
    { "job_name": "核保管理13", "job_duty": "1) 接收客户线上需求，并根据业务流程要求为客户提供解决方案 <br>2) 跟进/监控个案的后续发展，确保客户同步得到处理结果 <br>3) 处理客户抱怨或投诉，并按流程要求进行个案升级，安抚客户 <br>4) 分析问题， 解决问题", "job_num": "本科及以上；", "job_need": "1、全日制本科及以上学历，精算、统计、数学、金融、保险等相关专业优先；<br> 2、具备良好的人际沟通、组织协调能力和团队合作精神；<br>3、具备较强的责任感、上进心与抗压力；<br>27、具有创新意识与能力", "job_address": "深圳市" },
    { "job_name": "核保管理14", "job_duty": "1) 接收客户线上需求，并根据业务流程要求为客户提供解决方案 <br>2) 跟进/监控个案的后续发展，确保客户同步得到处理结果 <br>3) 处理客户抱怨或投诉，并按流程要求进行个案升级，安抚客户 <br>4) 分析问题， 解决问题", "job_num": "本科及以上；", "job_need": "1、全日制本科及以上学历，精算、统计、数学、金融、保险等相关专业优先；<br> 2、具备良好的人际沟通、组织协调能力和团队合作精神；<br>3、具备较强的责任感、上进心与抗压力；<br>28、具有创新意识与能力", "job_address": "深圳市" },
    { "job_name": "核保管理15", "job_duty": "1) 接收客户线上需求，并根据业务流程要求为客户提供解决方案 <br>2) 跟进/监控个案的后续发展，确保客户同步得到处理结果 <br>3) 处理客户抱怨或投诉，并按流程要求进行个案升级，安抚客户 <br>4) 分析问题， 解决问题", "job_num": "本科及以上；", "job_need": "1、全日制本科及以上学历，精算、统计、数学、金融、保险等相关专业优先；<br> 2、具备良好的人际沟通、组织协调能力和团队合作精神；<br>3、具备较强的责任感、上进心与抗压力；<br>29、具有创新意识与能力", "job_address": "深圳市" },
    { "job_name": "核保管理16", "job_duty": "1) 接收客户线上需求，并根据业务流程要求为客户提供解决方案 <br>2) 跟进/监控个案的后续发展，确保客户同步得到处理结果 <br>3) 处理客户抱怨或投诉，并按流程要求进行个案升级，安抚客户 <br>4) 分析问题， 解决问题", "job_num": "本科及以上；", "job_need": "1、全日制本科及以上学历，精算、统计、数学、金融、保险等相关专业优先；<br> 2、具备良好的人际沟通、组织协调能力和团队合作精神；<br>3、具备较强的责任感、上进心与抗压力；<br>30、具有创新意识与能力", "job_address": "深圳市" },
    { "job_name": "核保管理17", "job_duty": "1) 接收客户线上需求，并根据业务流程要求为客户提供解决方案 <br>2) 跟进/监控个案的后续发展，确保客户同步得到处理结果 <br>3) 处理客户抱怨或投诉，并按流程要求进行个案升级，安抚客户 <br>4) 分析问题， 解决问题", "job_num": "本科及以上；", "job_need": "1、全日制本科及以上学历，精算、统计、数学、金融、保险等相关专业优先；<br> 2、具备良好的人际沟通、组织协调能力和团队合作精神；<br>3、具备较强的责任感、上进心与抗压力；<br>31、具有创新意识与能力", "job_address": "深圳市" },
    { "job_name": "核保管理18", "job_duty": "1) 接收客户线上需求，并根据业务流程要求为客户提供解决方案 <br>2) 跟进/监控个案的后续发展，确保客户同步得到处理结果 <br>3) 处理客户抱怨或投诉，并按流程要求进行个案升级，安抚客户 <br>4) 分析问题， 解决问题", "job_num": "本科及以上；", "job_need": "1、全日制本科及以上学历，精算、统计、数学、金融、保险等相关专业优先；<br> 2、具备良好的人际沟通、组织协调能力和团队合作精神；<br>3、具备较强的责任感、上进心与抗压力；<br>32、具有创新意识与能力", "job_address": "深圳市" },
    { "job_name": "核保管理19", "job_duty": "1) 接收客户线上需求，并根据业务流程要求为客户提供解决方案 <br>2) 跟进/监控个案的后续发展，确保客户同步得到处理结果 <br>3) 处理客户抱怨或投诉，并按流程要求进行个案升级，安抚客户 <br>4) 分析问题， 解决问题", "job_num": "本科及以上；", "job_need": "1、全日制本科及以上学历，精算、统计、数学、金融、保险等相关专业优先；<br> 2、具备良好的人际沟通、组织协调能力和团队合作精神；<br>3、具备较强的责任感、上进心与抗压力；<br>33、具有创新意识与能力", "job_address": "深圳市" },
    { "job_name": "核保管理20", "job_duty": "1) 接收客户线上需求，并根据业务流程要求为客户提供解决方案 <br>2) 跟进/监控个案的后续发展，确保客户同步得到处理结果 <br>3) 处理客户抱怨或投诉，并按流程要求进行个案升级，安抚客户 <br>4) 分析问题， 解决问题", "job_num": "本科及以上；", "job_need": "1、全日制本科及以上学历，精算、统计、数学、金融、保险等相关专业优先；<br> 2、具备良好的人际沟通、组织协调能力和团队合作精神；<br>3、具备较强的责任感、上进心与抗压力；<br>34、具有创新意识与能力", "job_address": "深圳市" },
    { "job_name": "核保管理21", "job_duty": "1) 接收客户线上需求，并根据业务流程要求为客户提供解决方案 <br>2) 跟进/监控个案的后续发展，确保客户同步得到处理结果 <br>3) 处理客户抱怨或投诉，并按流程要求进行个案升级，安抚客户 <br>4) 分析问题， 解决问题", "job_num": "本科及以上；", "job_need": "1、全日制本科及以上学历，精算、统计、数学、金融、保险等相关专业优先；<br> 2、具备良好的人际沟通、组织协调能力和团队合作精神；<br>3、具备较强的责任感、上进心与抗压力；<br>35、具有创新意识与能力", "job_address": "深圳市" },
    { "job_name": "核保管理22", "job_duty": "1) 接收客户线上需求，并根据业务流程要求为客户提供解决方案 <br>2) 跟进/监控个案的后续发展，确保客户同步得到处理结果 <br>3) 处理客户抱怨或投诉，并按流程要求进行个案升级，安抚客户 <br>4) 分析问题， 解决问题", "job_num": "本科及以上；", "job_need": "1、全日制本科及以上学历，精算、统计、数学、金融、保险等相关专业优先；<br> 2、具备良好的人际沟通、组织协调能力和团队合作精神；<br>3、具备较强的责任感、上进心与抗压力；<br>36、具有创新意识与能力", "job_address": "深圳市" },
    { "job_name": "核保管理23", "job_duty": "1) 接收客户线上需求，并根据业务流程要求为客户提供解决方案 <br>2) 跟进/监控个案的后续发展，确保客户同步得到处理结果 <br>3) 处理客户抱怨或投诉，并按流程要求进行个案升级，安抚客户 <br>4) 分析问题， 解决问题", "job_num": "本科及以上；", "job_need": "1、全日制本科及以上学历，精算、统计、数学、金融、保险等相关专业优先；<br> 2、具备良好的人际沟通、组织协调能力和团队合作精神；<br>3、具备较强的责任感、上进心与抗压力；<br>37、具有创新意识与能力", "job_address": "深圳市" },
    { "job_name": "核保管理24", "job_duty": "1) 接收客户线上需求，并根据业务流程要求为客户提供解决方案 <br>2) 跟进/监控个案的后续发展，确保客户同步得到处理结果 <br>3) 处理客户抱怨或投诉，并按流程要求进行个案升级，安抚客户 <br>4) 分析问题， 解决问题", "job_num": "本科及以上；", "job_need": "1、全日制本科及以上学历，精算、统计、数学、金融、保险等相关专业优先；<br> 2、具备良好的人际沟通、组织协调能力和团队合作精神；<br>3、具备较强的责任感、上进心与抗压力；<br>38、具有创新意识与能力", "job_address": "深圳市" },
    { "job_name": "核保管理25", "job_duty": "1) 接收客户线上需求，并根据业务流程要求为客户提供解决方案 <br>2) 跟进/监控个案的后续发展，确保客户同步得到处理结果 <br>3) 处理客户抱怨或投诉，并按流程要求进行个案升级，安抚客户 <br>4) 分析问题， 解决问题", "job_num": "本科及以上；", "job_need": "1、全日制本科及以上学历，精算、统计、数学、金融、保险等相关专业优先；<br> 2、具备良好的人际沟通、组织协调能力和团队合作精神；<br>3、具备较强的责任感、上进心与抗压力；<br>39、具有创新意识与能力", "job_address": "深圳市" },
    { "job_name": "核保管理26", "job_duty": "1) 接收客户线上需求，并根据业务流程要求为客户提供解决方案 <br>2) 跟进/监控个案的后续发展，确保客户同步得到处理结果 <br>3) 处理客户抱怨或投诉，并按流程要求进行个案升级，安抚客户 <br>4) 分析问题， 解决问题", "job_num": "本科及以上；", "job_need": "1、全日制本科及以上学历，精算、统计、数学、金融、保险等相关专业优先；<br> 2、具备良好的人际沟通、组织协调能力和团队合作精神；<br>3、具备较强的责任感、上进心与抗压力；<br>40、具有创新意识与能力", "job_address": "深圳市" },
    { "job_name": "核保管理27", "job_duty": "1) 接收客户线上需求，并根据业务流程要求为客户提供解决方案 <br>2) 跟进/监控个案的后续发展，确保客户同步得到处理结果 <br>3) 处理客户抱怨或投诉，并按流程要求进行个案升级，安抚客户 <br>4) 分析问题， 解决问题", "job_num": "本科及以上；", "job_need": "1、全日制本科及以上学历，精算、统计、数学、金融、保险等相关专业优先；<br> 2、具备良好的人际沟通、组织协调能力和团队合作精神；<br>3、具备较强的责任感、上进心与抗压力；<br>41、具有创新意识与能力", "job_address": "深圳市" },
    { "job_name": "核保管理28", "job_duty": "1) 接收客户线上需求，并根据业务流程要求为客户提供解决方案 <br>2) 跟进/监控个案的后续发展，确保客户同步得到处理结果 <br>3) 处理客户抱怨或投诉，并按流程要求进行个案升级，安抚客户 <br>4) 分析问题， 解决问题", "job_num": "本科及以上；", "job_need": "1、全日制本科及以上学历，精算、统计、数学、金融、保险等相关专业优先；<br> 2、具备良好的人际沟通、组织协调能力和团队合作精神；<br>3、具备较强的责任感、上进心与抗压力；<br>42、具有创新意识与能力", "job_address": "深圳市" },
    { "job_name": "核保管理29", "job_duty": "1) 接收客户线上需求，并根据业务流程要求为客户提供解决方案 <br>2) 跟进/监控个案的后续发展，确保客户同步得到处理结果 <br>3) 处理客户抱怨或投诉，并按流程要求进行个案升级，安抚客户 <br>4) 分析问题， 解决问题", "job_num": "本科及以上；", "job_need": "1、全日制本科及以上学历，精算、统计、数学、金融、保险等相关专业优先；<br> 2、具备良好的人际沟通、组织协调能力和团队合作精神；<br>3、具备较强的责任感、上进心与抗压力；<br>43、具有创新意识与能力", "job_address": "深圳市" },
    { "job_name": "核保管理30", "job_duty": "1) 接收客户线上需求，并根据业务流程要求为客户提供解决方案 <br>2) 跟进/监控个案的后续发展，确保客户同步得到处理结果 <br>3) 处理客户抱怨或投诉，并按流程要求进行个案升级，安抚客户 <br>4) 分析问题， 解决问题", "job_num": "本科及以上；", "job_need": "1、全日制本科及以上学历，精算、统计、数学、金融、保险等相关专业优先；<br> 2、具备良好的人际沟通、组织协调能力和团队合作精神；<br>3、具备较强的责任感、上进心与抗压力；<br>44、具有创新意识与能力", "job_address": "深圳市" },
    { "job_name": "核保管理31", "job_duty": "1) 接收客户线上需求，并根据业务流程要求为客户提供解决方案 <br>2) 跟进/监控个案的后续发展，确保客户同步得到处理结果 <br>3) 处理客户抱怨或投诉，并按流程要求进行个案升级，安抚客户 <br>4) 分析问题， 解决问题", "job_num": "本科及以上；", "job_need": "1、全日制本科及以上学历，精算、统计、数学、金融、保险等相关专业优先；<br> 2、具备良好的人际沟通、组织协调能力和团队合作精神；<br>3、具备较强的责任感、上进心与抗压力；<br>45、具有创新意识与能力", "job_address": "深圳市" },
    { "job_name": "核保管理32", "job_duty": "1) 接收客户线上需求，并根据业务流程要求为客户提供解决方案 <br>2) 跟进/监控个案的后续发展，确保客户同步得到处理结果 <br>3) 处理客户抱怨或投诉，并按流程要求进行个案升级，安抚客户 <br>4) 分析问题， 解决问题", "job_num": "本科及以上；", "job_need": "1、全日制本科及以上学历，精算、统计、数学、金融、保险等相关专业优先；<br> 2、具备良好的人际沟通、组织协调能力和团队合作精神；<br>3、具备较强的责任感、上进心与抗压力；<br>46、具有创新意识与能力", "job_address": "深圳市" },
    { "job_name": "核保管理33", "job_duty": "1) 接收客户线上需求，并根据业务流程要求为客户提供解决方案 <br>2) 跟进/监控个案的后续发展，确保客户同步得到处理结果 <br>3) 处理客户抱怨或投诉，并按流程要求进行个案升级，安抚客户 <br>4) 分析问题， 解决问题", "job_num": "本科及以上；", "job_need": "1、全日制本科及以上学历，精算、统计、数学、金融、保险等相关专业优先；<br> 2、具备良好的人际沟通、组织协调能力和团队合作精神；<br>3、具备较强的责任感、上进心与抗压力；<br>47、具有创新意识与能力", "job_address": "深圳市" },
    { "job_name": "核保管理34", "job_duty": "1) 接收客户线上需求，并根据业务流程要求为客户提供解决方案 <br>2) 跟进/监控个案的后续发展，确保客户同步得到处理结果 <br>3) 处理客户抱怨或投诉，并按流程要求进行个案升级，安抚客户 <br>4) 分析问题， 解决问题", "job_num": "本科及以上；", "job_need": "1、全日制本科及以上学历，精算、统计、数学、金融、保险等相关专业优先；<br> 2、具备良好的人际沟通、组织协调能力和团队合作精神；<br>3、具备较强的责任感、上进心与抗压力；<br>48、具有创新意识与能力", "job_address": "深圳市" },
    { "job_name": "核保管理35", "job_duty": "1) 接收客户线上需求，并根据业务流程要求为客户提供解决方案 <br>2) 跟进/监控个案的后续发展，确保客户同步得到处理结果 <br>3) 处理客户抱怨或投诉，并按流程要求进行个案升级，安抚客户 <br>4) 分析问题， 解决问题", "job_num": "本科及以上；", "job_need": "1、全日制本科及以上学历，精算、统计、数学、金融、保险等相关专业优先；<br> 2、具备良好的人际沟通、组织协调能力和团队合作精神；<br>3、具备较强的责任感、上进心与抗压力；<br>49、具有创新意识与能力", "job_address": "深圳市" },
    { "job_name": "核保管理36", "job_duty": "1) 接收客户线上需求，并根据业务流程要求为客户提供解决方案 <br>2) 跟进/监控个案的后续发展，确保客户同步得到处理结果 <br>3) 处理客户抱怨或投诉，并按流程要求进行个案升级，安抚客户 <br>4) 分析问题， 解决问题", "job_num": "本科及以上；", "job_need": "1、全日制本科及以上学历，精算、统计、数学、金融、保险等相关专业优先；<br> 2、具备良好的人际沟通、组织协调能力和团队合作精神；<br>3、具备较强的责任感、上进心与抗压力；<br>50、具有创新意识与能力", "job_address": "深圳市" },
    { "job_name": "核保管理37", "job_duty": "1) 接收客户线上需求，并根据业务流程要求为客户提供解决方案 <br>2) 跟进/监控个案的后续发展，确保客户同步得到处理结果 <br>3) 处理客户抱怨或投诉，并按流程要求进行个案升级，安抚客户 <br>4) 分析问题， 解决问题", "job_num": "本科及以上；", "job_need": "1、全日制本科及以上学历，精算、统计、数学、金融、保险等相关专业优先；<br> 2、具备良好的人际沟通、组织协调能力和团队合作精神；<br>3、具备较强的责任感、上进心与抗压力；<br>51、具有创新意识与能力", "job_address": "深圳市" },
    { "job_name": "核保管理38", "job_duty": "1) 接收客户线上需求，并根据业务流程要求为客户提供解决方案 <br>2) 跟进/监控个案的后续发展，确保客户同步得到处理结果 <br>3) 处理客户抱怨或投诉，并按流程要求进行个案升级，安抚客户 <br>4) 分析问题， 解决问题", "job_num": "本科及以上；", "job_need": "1、全日制本科及以上学历，精算、统计、数学、金融、保险等相关专业优先；<br> 2、具备良好的人际沟通、组织协调能力和团队合作精神；<br>3、具备较强的责任感、上进心与抗压力；<br>52、具有创新意识与能力", "job_address": "深圳市" },
    { "job_name": "核保管理39", "job_duty": "1) 接收客户线上需求，并根据业务流程要求为客户提供解决方案 <br>2) 跟进/监控个案的后续发展，确保客户同步得到处理结果 <br>3) 处理客户抱怨或投诉，并按流程要求进行个案升级，安抚客户 <br>4) 分析问题， 解决问题", "job_num": "本科及以上；", "job_need": "1、全日制本科及以上学历，精算、统计、数学、金融、保险等相关专业优先；<br> 2、具备良好的人际沟通、组织协调能力和团队合作精神；<br>3、具备较强的责任感、上进心与抗压力；<br>53、具有创新意识与能力", "job_address": "深圳市" },
    { "job_name": "核保管理40", "job_duty": "1) 接收客户线上需求，并根据业务流程要求为客户提供解决方案 <br>2) 跟进/监控个案的后续发展，确保客户同步得到处理结果 <br>3) 处理客户抱怨或投诉，并按流程要求进行个案升级，安抚客户 <br>4) 分析问题， 解决问题", "job_num": "本科及以上；", "job_need": "1、全日制本科及以上学历，精算、统计、数学、金融、保险等相关专业优先；<br> 2、具备良好的人际沟通、组织协调能力和团队合作精神；<br>3、具备较强的责任感、上进心与抗压力；<br>54、具有创新意识与能力", "job_address": "深圳市" },
    { "job_name": "核保管理41", "job_duty": "1) 接收客户线上需求，并根据业务流程要求为客户提供解决方案 <br>2) 跟进/监控个案的后续发展，确保客户同步得到处理结果 <br>3) 处理客户抱怨或投诉，并按流程要求进行个案升级，安抚客户 <br>4) 分析问题， 解决问题", "job_num": "本科及以上；", "job_need": "1、全日制本科及以上学历，精算、统计、数学、金融、保险等相关专业优先；<br> 2、具备良好的人际沟通、组织协调能力和团队合作精神；<br>3、具备较强的责任感、上进心与抗压力；<br>55、具有创新意识与能力", "job_address": "深圳市" },
    { "job_name": "核保管理42", "job_duty": "1) 接收客户线上需求，并根据业务流程要求为客户提供解决方案 <br>2) 跟进/监控个案的后续发展，确保客户同步得到处理结果 <br>3) 处理客户抱怨或投诉，并按流程要求进行个案升级，安抚客户 <br>4) 分析问题， 解决问题", "job_num": "本科及以上；", "job_need": "1、全日制本科及以上学历，精算、统计、数学、金融、保险等相关专业优先；<br> 2、具备良好的人际沟通、组织协调能力和团队合作精神；<br>3、具备较强的责任感、上进心与抗压力；<br>56、具有创新意识与能力", "job_address": "深圳市" },
    { "job_name": "核保管理43", "job_duty": "1) 接收客户线上需求，并根据业务流程要求为客户提供解决方案 <br>2) 跟进/监控个案的后续发展，确保客户同步得到处理结果 <br>3) 处理客户抱怨或投诉，并按流程要求进行个案升级，安抚客户 <br>4) 分析问题， 解决问题", "job_num": "本科及以上；", "job_need": "1、全日制本科及以上学历，精算、统计、数学、金融、保险等相关专业优先；<br> 2、具备良好的人际沟通、组织协调能力和团队合作精神；<br>3、具备较强的责任感、上进心与抗压力；<br>57、具有创新意识与能力", "job_address": "深圳市" },
    { "job_name": "核保管理44", "job_duty": "1) 接收客户线上需求，并根据业务流程要求为客户提供解决方案 <br>2) 跟进/监控个案的后续发展，确保客户同步得到处理结果 <br>3) 处理客户抱怨或投诉，并按流程要求进行个案升级，安抚客户 <br>4) 分析问题， 解决问题", "job_num": "本科及以上；", "job_need": "1、全日制本科及以上学历，精算、统计、数学、金融、保险等相关专业优先；<br> 2、具备良好的人际沟通、组织协调能力和团队合作精神；<br>3、具备较强的责任感、上进心与抗压力；<br>58、具有创新意识与能力", "job_address": "深圳市" },
    { "job_name": "核保管理45", "job_duty": "1) 接收客户线上需求，并根据业务流程要求为客户提供解决方案 <br>2) 跟进/监控个案的后续发展，确保客户同步得到处理结果 <br>3) 处理客户抱怨或投诉，并按流程要求进行个案升级，安抚客户 <br>4) 分析问题， 解决问题", "job_num": "本科及以上；", "job_need": "1、全日制本科及以上学历，精算、统计、数学、金融、保险等相关专业优先；<br> 2、具备良好的人际沟通、组织协调能力和团队合作精神；<br>3、具备较强的责任感、上进心与抗压力；<br>59、具有创新意识与能力", "job_address": "深圳市" },
    { "job_name": "核保管理46", "job_duty": "1) 接收客户线上需求，并根据业务流程要求为客户提供解决方案 <br>2) 跟进/监控个案的后续发展，确保客户同步得到处理结果 <br>3) 处理客户抱怨或投诉，并按流程要求进行个案升级，安抚客户 <br>4) 分析问题， 解决问题", "job_num": "本科及以上；", "job_need": "1、全日制本科及以上学历，精算、统计、数学、金融、保险等相关专业优先；<br> 2、具备良好的人际沟通、组织协调能力和团队合作精神；<br>3、具备较强的责任感、上进心与抗压力；<br>60、具有创新意识与能力", "job_address": "深圳市" },
    { "job_name": "核保管理47", "job_duty": "1) 接收客户线上需求，并根据业务流程要求为客户提供解决方案 <br>2) 跟进/监控个案的后续发展，确保客户同步得到处理结果 <br>3) 处理客户抱怨或投诉，并按流程要求进行个案升级，安抚客户 <br>4) 分析问题， 解决问题", "job_num": "本科及以上；", "job_need": "1、全日制本科及以上学历，精算、统计、数学、金融、保险等相关专业优先；<br> 2、具备良好的人际沟通、组织协调能力和团队合作精神；<br>3、具备较强的责任感、上进心与抗压力；<br>61、具有创新意识与能力", "job_address": "深圳市" },
    { "job_name": "核保管理48", "job_duty": "1) 接收客户线上需求，并根据业务流程要求为客户提供解决方案 <br>2) 跟进/监控个案的后续发展，确保客户同步得到处理结果 <br>3) 处理客户抱怨或投诉，并按流程要求进行个案升级，安抚客户 <br>4) 分析问题， 解决问题", "job_num": "本科及以上；", "job_need": "1、全日制本科及以上学历，精算、统计、数学、金融、保险等相关专业优先；<br> 2、具备良好的人际沟通、组织协调能力和团队合作精神；<br>3、具备较强的责任感、上进心与抗压力；<br>62、具有创新意识与能力", "job_address": "深圳市" },
    { "job_name": "核保管理49", "job_duty": "1) 接收客户线上需求，并根据业务流程要求为客户提供解决方案 <br>2) 跟进/监控个案的后续发展，确保客户同步得到处理结果 <br>3) 处理客户抱怨或投诉，并按流程要求进行个案升级，安抚客户 <br>4) 分析问题， 解决问题", "job_num": "本科及以上；", "job_need": "1、全日制本科及以上学历，精算、统计、数学、金融、保险等相关专业优先；<br> 2、具备良好的人际沟通、组织协调能力和团队合作精神；<br>3、具备较强的责任感、上进心与抗压力；<br>63、具有创新意识与能力", "job_address": "深圳市" },

];

var job_list = [];
dataList.forEach(function (item) {
    if (job_list.indexOf(item.job_name) == -1) {
        job_list.push(item.job_name);
    }
})

var html = "";

job_list.forEach(function (item, index) {
    html += '<div class="job_name" s_id=' + index + ' >' + item + '</div>'
})

$(".left_nav").html(html);

function init() {

    $(".left_nav .job_name").each(function (index, item) {

        if ($(item).index() * 1 < 12) {

            $(item).show();

        } else {
            $(item).hide();
        }
    })

    sessionStorage.setItem("nowPage", "1");

    $(".left_nav .job_name").eq(0).addClass("job_active");

}

init();

$(".outside_box").scrollBar();

// 职位名点击事件
$(".left_nav .job_name").click(function () {
    var index = $(this).index() * 1;
    // 内容替换 duty_text 为岗位职责   need_text  为岗位需求  j_name 为职位名  
    $(".duty_text").html(dataList[index].job_duty);
    $(".need_text").html(dataList[index].job_need);
    $(".j_name").html(dataList[index].job_name);

    // 活性样式替换
    $(this).addClass("job_active").siblings().removeClass("job_active");
})

// 箭头切换事件  右
$(".job_right_arrow").click(function () {
    // 左箭头可用
    $(".job_left_arrow").css("opacity", "1");

    // 获取当前页
    var num = (sessionStorage.getItem("nowPage") * 1) + 1;

    // 临界值判断
    if (num >= job_list.length / 12) {
        num = job_list.length / 12;
        $(".job_right_arrow").css("opacity", "0.5");
    }

    // 存储页码数
    sessionStorage.setItem("nowPage", num);
    $(".left_nav .job_name").each(function (index, item) {

        var id = $(item).index() * 1;

        if (id < num * 12 && id >= (num - 1) * 12) {

            $(item).show();

        } else {

            $(item).hide();

        }
    })

})

// 箭头切换事件  左

$(".job_left_arrow").click(function () {

    $(".job_right_arrow").css("opacity", "1");

    var num = (sessionStorage.getItem("nowPage") * 1) - 1;

    if (num <= 1) {
        num = 1;
        $(".job_left_arrow").css("opacity", "0.5");
    }

    sessionStorage.setItem("nowPage", num);

    $(".left_nav .job_name").each(function (index, item) {

        var id = $(item).index() * 1;

        if (id < num * 12 && id >= (num - 1) * 12) {

            $(item).show();

        } else {
            $(item).hide();
        }
    })

})