var dataList = [
    { "job_name": "精算", "job_duty": "1) 接收客户线上需求，并根据业务流程要求为客户提供解决方案 <br>2) 跟进/监控个案的后续发展，确保客户同步得到处理结果 <br>3) 处理客户抱怨或投诉，并按流程要求进行个案升级，安抚客户 <br>4) 分析问题， 解决问题", "job_num": "本科及以上；", "job_need": "1、全日制本科及以上学历，精算、统计、数学、金融、保险等相关专业优先；<br> 2、具备良好的人际沟通、组织协调能力和团队合作精神；<br>3、具备较强的责任感、上进心与抗压力；<br>4、具有创新意识与能力", "job_address": "深圳市" },
    { "job_name": "风险管理", "job_duty": "1) 接收客户线上需求2，并根据业务流程要求为客户提供解决方案 <br>2) 跟进/监控个案的后续发展，确保客户同步得到处理结果 <br>3) 处理客户抱怨或投诉，并按流程要求进行个案升级，安抚客户 <br>4) 分析问题， 解决问题", "job_num": "本科及以上；", "job_need": "1、全日制本科及以上学历，精算、统计、数学、金融、保险等相关专业优先；<br> 2、具备良好的人际沟通、组织协调能力和团队合作精神；<br>3、具备较强的责任感、上进心与抗压力；<br>5、具有创新意识与能力", "job_address": "深圳市" },
    { "job_name": "市场研究", "job_duty": "1) 接收客户线上需求3，并根据业务流程要求为客户提供解决方案 <br>2) 跟进/监控个案的后续发展，确保客户同步得到处理结果 <br>3) 处理客户抱怨或投诉，并按流程要求进行个案升级，安抚客户 <br>4) 分析问题， 解决问题", "job_num": "本科及以上；", "job_need": "1、全日制本科及以上学历，精算、统计、数学、金融、保险等相关专业优先；<br> 2、具备良好的人际沟通、组织协调能力和团队合作精神；<br>3、具备较强的责任感、上进心与抗压力；<br>6、具有创新意识与能力", "job_address": "深圳市" },
    { "job_name": "投资管理", "job_duty": "1) 接收客户线上需求，并根据业务流程要求为客户提供解决方案 <br>2) 跟进/监控个案的后续发展，确保客户同步得到处理结果 <br>3) 处理客户抱怨或投诉，并按流程要求进行个案升级，安抚客户 <br>4) 分析问题， 解决问题", "job_num": "本科及以上；", "job_need": "1、全日制本科及以上学历，精算、统计、数学、金融、保险等相关专业优先；<br> 2、具备良好的人际沟通、组织协调能力和团队合作精神；<br>3、具备较强的责任感、上进心与抗压力；<br>7、具有创新意识与能力", "job_address": "深圳市" },
    { "job_name": "再保管理", "job_duty": "1) 接收客户线上需求，并根据业务流程要求为客户提供解决方案 <br>2) 跟进/监控个案的后续发展，确保客户同步得到处理结果 <br>3) 处理客户抱怨或投诉，并按流程要求进行个案升级，安抚客户 <br>4) 分析问题， 解决问题", "job_num": "本科及以上；", "job_need": "1、全日制本科及以上学历，精算、统计、数学、金融、保险等相关专业优先；<br> 2、具备良好的人际沟通、组织协调能力和团队合作精神；<br>3、具备较强的责任感、上进心与抗压力；<br>8、具有创新意识与能力", "job_address": "深圳市" },
    { "job_name": "审计", "job_duty": "1) 接收客户线上需求，并根据业务流程要求为客户提供解决方案 <br>2) 跟进/监控个案的后续发展，确保客户同步得到处理结果 <br>3) 处理客户抱怨或投诉，并按流程要求进行个案升级，安抚客户 <br>4) 分析问题， 解决问题", "job_num": "本科及以上；", "job_need": "1、全日制本科及以上学历，精算、统计、数学、金融、保险等相关专业优先；<br> 2、具备良好的人际沟通、组织协调能力和团队合作精神；<br>3、具备较强的责任感、上进心与抗压力；<br>9、具有创新意识与能力", "job_address": "深圳市" },
    { "job_name": "合规法务", "job_duty": "1) 接收客户线上需求，并根据业务流程要求为客户提供解决方案 <br>2) 跟进/监控个案的后续发展，确保客户同步得到处理结果 <br>3) 处理客户抱怨或投诉，并按流程要求进行个案升级，安抚客户 <br>4) 分析问题， 解决问题", "job_num": "本科及以上；", "job_need": "1、全日制本科及以上学历，精算、统计、数学、金融、保险等相关专业优先；<br> 2、具备良好的人际沟通、组织协调能力和团队合作精神；<br>3、具备较强的责任感、上进心与抗压力；<br>10、具有创新意识与能力", "job_address": "深圳市" },
    { "job_name": "统计分析", "job_duty": "1) 接收客户线上需求，并根据业务流程要求为客户提供解决方案 <br>2) 跟进/监控个案的后续发展，确保客户同步得到处理结果 <br>3) 处理客户抱怨或投诉，并按流程要求进行个案升级，安抚客户 <br>4) 分析问题， 解决问题", "job_num": "本科及以上；", "job_need": "1、全日制本科及以上学历，精算、统计、数学、金融、保险等相关专业优先；<br> 2、具备良好的人际沟通、组织协调能力和团队合作精神；<br>3、具备较强的责任感、上进心与抗压力；<br>11、具有创新意识与能力", "job_address": "深圳市" },
    { "job_name": "市场营销", "job_duty": "1) 接收客户线上需求，并根据业务流程要求为客户提供解决方案 <br>2) 跟进/监控个案的后续发展，确保客户同步得到处理结果 <br>3) 处理客户抱怨或投诉，并按流程要求进行个案升级，安抚客户 <br>4) 分析问题， 解决问题", "job_num": "本科及以上；", "job_need": "1、全日制本科及以上学历，精算、统计、数学、金融、保险等相关专业优先；<br> 2、具备良好的人际沟通、组织协调能力和团队合作精神；<br>3、具备较强的责任感、上进心与抗压力；<br>12、具有创新意识与能力", "job_address": "深圳市" },
    { "job_name": "电子商务", "job_duty": "1) 接收客户线上需求，并根据业务流程要求为客户提供解决方案 <br>2) 跟进/监控个案的后续发展，确保客户同步得到处理结果 <br>3) 处理客户抱怨或投诉，并按流程要求进行个案升级，安抚客户 <br>4) 分析问题， 解决问题", "job_num": "本科及以上；", "job_need": "1、全日制本科及以上学历，精算、统计、数学、金融、保险等相关专业优先；<br> 2、具备良好的人际沟通、组织协调能力和团队合作精神；<br>3、具备较强的责任感、上进心与抗压力；<br>13、具有创新意识与能力", "job_address": "深圳市" },
    { "job_name": "核赔管理", "job_duty": "1) 接收客户线上需求，并根据业务流程要求为客户提供解决方案 <br>2) 跟进/监控个案的后续发展，确保客户同步得到处理结果 <br>3) 处理客户抱怨或投诉，并按流程要求进行个案升级，安抚客户 <br>4) 分析问题， 解决问题", "job_num": "本科及以上；", "job_need": "1、全日制本科及以上学历，精算、统计、数学、金融、保险等相关专业优先；<br> 2、具备良好的人际沟通、组织协调能力和团队合作精神；<br>3、具备较强的责任感、上进心与抗压力；<br>14、具有创新意识与能力", "job_address": "深圳市" },
    { "job_name": "核保管理1", "job_duty": "1) 接收客户线上需求，并根据业务流程要求为客户提供解决方案 <br>2) 跟进/监控个案的后续发展，确保客户同步得到处理结果 <br>3) 处理客户抱怨或投诉，并按流程要求进行个案升级，安抚客户 <br>4) 分析问题， 解决问题", "job_num": "本科及以上；", "job_need": "1、全日制本科及以上学历，精算、统计、数学、金融、保险等相关专业优先；<br> 2、具备良好的人际沟通、组织协调能力和团队合作精神；<br>3、具备较强的责任感、上进心与抗压力；<br>15、具有创新意识与能力", "job_address": "深圳市" },
    { "job_name": "核保管理2", "job_duty": "1) 接收客户线上需求，并根据业务流程要求为客户提供解决方案 <br>2) 跟进/监控个案的后续发展，确保客户同步得到处理结果 <br>3) 处理客户抱怨或投诉，并按流程要求进行个案升级，安抚客户 <br>4) 分析问题， 解决问题", "job_num": "本科及以上；", "job_need": "1、全日制本科及以上学历，精算、统计、数学、金融、保险等相关专业优先；<br> 2、具备良好的人际沟通、组织协调能力和团队合作精神；<br>3、具备较强的责任感、上进心与抗压力；<br>16、具有创新意识与能力", "job_address": "深圳市" },
    { "job_name": "核保管理3", "job_duty": "1) 接收客户线上需求，并根据业务流程要求为客户提供解决方案 <br>2) 跟进/监控个案的后续发展，确保客户同步得到处理结果 <br>3) 处理客户抱怨或投诉，并按流程要求进行个案升级，安抚客户 <br>4) 分析问题， 解决问题", "job_num": "本科及以上；", "job_need": "1、全日制本科及以上学历，精算、统计、数学、金融、保险等相关专业优先；<br> 2、具备良好的人际沟通、组织协调能力和团队合作精神；<br>3、具备较强的责任感、上进心与抗压力；<br>17、具有创新意识与能力", "job_address": "深圳市" },
    { "job_name": "核保管理4", "job_duty": "1) 接收客户线上需求，并根据业务流程要求为客户提供解决方案 <br>2) 跟进/监控个案的后续发展，确保客户同步得到处理结果 <br>3) 处理客户抱怨或投诉，并按流程要求进行个案升级，安抚客户 <br>4) 分析问题， 解决问题", "job_num": "本科及以上；", "job_need": "1、全日制本科及以上学历，精算、统计、数学、金融、保险等相关专业优先；<br> 2、具备良好的人际沟通、组织协调能力和团队合作精神；<br>3、具备较强的责任感、上进心与抗压力；<br>18、具有创新意识与能力", "job_address": "深圳市" },
    { "job_name": "核保管理5", "job_duty": "1) 接收客户线上需求，并根据业务流程要求为客户提供解决方案 <br>2) 跟进/监控个案的后续发展，确保客户同步得到处理结果 <br>3) 处理客户抱怨或投诉，并按流程要求进行个案升级，安抚客户 <br>4) 分析问题， 解决问题", "job_num": "本科及以上；", "job_need": "1、全日制本科及以上学历，精算、统计、数学、金融、保险等相关专业优先；<br> 2、具备良好的人际沟通、组织协调能力和团队合作精神；<br>3、具备较强的责任感、上进心与抗压力；<br>19、具有创新意识与能力", "job_address": "深圳市" },
    { "job_name": "核保管理6", "job_duty": "1) 接收客户线上需求，并根据业务流程要求为客户提供解决方案 <br>2) 跟进/监控个案的后续发展，确保客户同步得到处理结果 <br>3) 处理客户抱怨或投诉，并按流程要求进行个案升级，安抚客户 <br>4) 分析问题， 解决问题", "job_num": "本科及以上；", "job_need": "1、全日制本科及以上学历，精算、统计、数学、金融、保险等相关专业优先；<br> 2、具备良好的人际沟通、组织协调能力和团队合作精神；<br>3、具备较强的责任感、上进心与抗压力；<br>20、具有创新意识与能力", "job_address": "深圳市" },
    { "job_name": "核保管理7", "job_duty": "1) 接收客户线上需求，并根据业务流程要求为客户提供解决方案 <br>2) 跟进/监控个案的后续发展，确保客户同步得到处理结果 <br>3) 处理客户抱怨或投诉，并按流程要求进行个案升级，安抚客户 <br>4) 分析问题， 解决问题", "job_num": "本科及以上；", "job_need": "1、全日制本科及以上学历，精算、统计、数学、金融、保险等相关专业优先；<br> 2、具备良好的人际沟通、组织协调能力和团队合作精神；<br>3、具备较强的责任感、上进心与抗压力；<br>21、具有创新意识与能力", "job_address": "深圳市" },
    { "job_name": "核保管理8", "job_duty": "1) 接收客户线上需求，并根据业务流程要求为客户提供解决方案 <br>2) 跟进/监控个案的后续发展，确保客户同步得到处理结果 <br>3) 处理客户抱怨或投诉，并按流程要求进行个案升级，安抚客户 <br>4) 分析问题， 解决问题", "job_num": "本科及以上；", "job_need": "1、全日制本科及以上学历，精算、统计、数学、金融、保险等相关专业优先；<br> 2、具备良好的人际沟通、组织协调能力和团队合作精神；<br>3、具备较强的责任感、上进心与抗压力；<br>22、具有创新意识与能力", "job_address": "深圳市" },
    { "job_name": "核保管理9", "job_duty": "1) 接收客户线上需求，并根据业务流程要求为客户提供解决方案 <br>2) 跟进/监控个案的后续发展，确保客户同步得到处理结果 <br>3) 处理客户抱怨或投诉，并按流程要求进行个案升级，安抚客户 <br>4) 分析问题， 解决问题", "job_num": "本科及以上；", "job_need": "1、全日制本科及以上学历，精算、统计、数学、金融、保险等相关专业优先；<br> 2、具备良好的人际沟通、组织协调能力和团队合作精神；<br>3、具备较强的责任感、上进心与抗压力；<br>23、具有创新意识与能力", "job_address": "深圳市" },
    { "job_name": "核保管理10", "job_duty": "1) 接收客户线上需求，并根据业务流程要求为客户提供解决方案 <br>2) 跟进/监控个案的后续发展，确保客户同步得到处理结果 <br>3) 处理客户抱怨或投诉，并按流程要求进行个案升级，安抚客户 <br>4) 分析问题， 解决问题", "job_num": "本科及以上；", "job_need": "1、全日制本科及以上学历，精算、统计、数学、金融、保险等相关专业优先；<br> 2、具备良好的人际沟通、组织协调能力和团队合作精神；<br>3、具备较强的责任感、上进心与抗压力；<br>24、具有创新意识与能力", "job_address": "深圳市" },
    { "job_name": "核保管理11", "job_duty": "1) 接收客户线上需求，并根据业务流程要求为客户提供解决方案 <br>2) 跟进/监控个案的后续发展，确保客户同步得到处理结果 <br>3) 处理客户抱怨或投诉，并按流程要求进行个案升级，安抚客户 <br>4) 分析问题， 解决问题", "job_num": "本科及以上；", "job_need": "1、全日制本科及以上学历，精算、统计、数学、金融、保险等相关专业优先；<br> 2、具备良好的人际沟通、组织协调能力和团队合作精神；<br>3、具备较强的责任感、上进心与抗压力；<br>25、具有创新意识与能力", "job_address": "深圳市" },
    { "job_name": "核保管理12", "job_duty": "1) 接收客户线上需求，并根据业务流程要求为客户提供解决方案 <br>2) 跟进/监控个案的后续发展，确保客户同步得到处理结果 <br>3) 处理客户抱怨或投诉，并按流程要求进行个案升级，安抚客户 <br>4) 分析问题， 解决问题", "job_num": "本科及以上；", "job_need": "1、全日制本科及以上学历，精算、统计、数学、金融、保险等相关专业优先；<br> 2、具备良好的人际沟通、组织协调能力和团队合作精神；<br>3、具备较强的责任感、上进心与抗压力；<br>26、具有创新意识与能力", "job_address": "深圳市" },
    { "job_name": "核保管理13", "job_duty": "1) 接收客户线上需求，并根据业务流程要求为客户提供解决方案 <br>2) 跟进/监控个案的后续发展，确保客户同步得到处理结果 <br>3) 处理客户抱怨或投诉，并按流程要求进行个案升级，安抚客户 <br>4) 分析问题， 解决问题", "job_num": "本科及以上；", "job_need": "1、全日制本科及以上学历，精算、统计、数学、金融、保险等相关专业优先；<br> 2、具备良好的人际沟通、组织协调能力和团队合作精神；<br>3、具备较强的责任感、上进心与抗压力；<br>27、具有创新意识与能力", "job_address": "深圳市" },
    { "job_name": "核保管理14", "job_duty": "1) 接收客户线上需求，并根据业务流程要求为客户提供解决方案 <br>2) 跟进/监控个案的后续发展，确保客户同步得到处理结果 <br>3) 处理客户抱怨或投诉，并按流程要求进行个案升级，安抚客户 <br>4) 分析问题， 解决问题", "job_num": "本科及以上；", "job_need": "1、全日制本科及以上学历，精算、统计、数学、金融、保险等相关专业优先；<br> 2、具备良好的人际沟通、组织协调能力和团队合作精神；<br>3、具备较强的责任感、上进心与抗压力；<br>28、具有创新意识与能力", "job_address": "深圳市" },
    { "job_name": "核保管理15", "job_duty": "1) 接收客户线上需求，并根据业务流程要求为客户提供解决方案 <br>2) 跟进/监控个案的后续发展，确保客户同步得到处理结果 <br>3) 处理客户抱怨或投诉，并按流程要求进行个案升级，安抚客户 <br>4) 分析问题， 解决问题", "job_num": "本科及以上；", "job_need": "1、全日制本科及以上学历，精算、统计、数学、金融、保险等相关专业优先；<br> 2、具备良好的人际沟通、组织协调能力和团队合作精神；<br>3、具备较强的责任感、上进心与抗压力；<br>29、具有创新意识与能力", "job_address": "深圳市" },
    { "job_name": "核保管理16", "job_duty": "1) 接收客户线上需求，并根据业务流程要求为客户提供解决方案 <br>2) 跟进/监控个案的后续发展，确保客户同步得到处理结果 <br>3) 处理客户抱怨或投诉，并按流程要求进行个案升级，安抚客户 <br>4) 分析问题， 解决问题", "job_num": "本科及以上；", "job_need": "1、全日制本科及以上学历，精算、统计、数学、金融、保险等相关专业优先；<br> 2、具备良好的人际沟通、组织协调能力和团队合作精神；<br>3、具备较强的责任感、上进心与抗压力；<br>30、具有创新意识与能力", "job_address": "深圳市" },
    { "job_name": "核保管理17", "job_duty": "1) 接收客户线上需求，并根据业务流程要求为客户提供解决方案 <br>2) 跟进/监控个案的后续发展，确保客户同步得到处理结果 <br>3) 处理客户抱怨或投诉，并按流程要求进行个案升级，安抚客户 <br>4) 分析问题， 解决问题", "job_num": "本科及以上；", "job_need": "1、全日制本科及以上学历，精算、统计、数学、金融、保险等相关专业优先；<br> 2、具备良好的人际沟通、组织协调能力和团队合作精神；<br>3、具备较强的责任感、上进心与抗压力；<br>31、具有创新意识与能力", "job_address": "深圳市" },
    { "job_name": "核保管理18", "job_duty": "1) 接收客户线上需求，并根据业务流程要求为客户提供解决方案 <br>2) 跟进/监控个案的后续发展，确保客户同步得到处理结果 <br>3) 处理客户抱怨或投诉，并按流程要求进行个案升级，安抚客户 <br>4) 分析问题， 解决问题", "job_num": "本科及以上；", "job_need": "1、全日制本科及以上学历，精算、统计、数学、金融、保险等相关专业优先；<br> 2、具备良好的人际沟通、组织协调能力和团队合作精神；<br>3、具备较强的责任感、上进心与抗压力；<br>32、具有创新意识与能力", "job_address": "深圳市" },
    { "job_name": "核保管理19", "job_duty": "1) 接收客户线上需求，并根据业务流程要求为客户提供解决方案 <br>2) 跟进/监控个案的后续发展，确保客户同步得到处理结果 <br>3) 处理客户抱怨或投诉，并按流程要求进行个案升级，安抚客户 <br>4) 分析问题， 解决问题", "job_num": "本科及以上；", "job_need": "1、全日制本科及以上学历，精算、统计、数学、金融、保险等相关专业优先；<br> 2、具备良好的人际沟通、组织协调能力和团队合作精神；<br>3、具备较强的责任感、上进心与抗压力；<br>33、具有创新意识与能力", "job_address": "深圳市" },
    { "job_name": "核保管理20", "job_duty": "1) 接收客户线上需求，并根据业务流程要求为客户提供解决方案 <br>2) 跟进/监控个案的后续发展，确保客户同步得到处理结果 <br>3) 处理客户抱怨或投诉，并按流程要求进行个案升级，安抚客户 <br>4) 分析问题， 解决问题", "job_num": "本科及以上；", "job_need": "1、全日制本科及以上学历，精算、统计、数学、金融、保险等相关专业优先；<br> 2、具备良好的人际沟通、组织协调能力和团队合作精神；<br>3、具备较强的责任感、上进心与抗压力；<br>34、具有创新意识与能力", "job_address": "深圳市" },
    { "job_name": "核保管理21", "job_duty": "1) 接收客户线上需求，并根据业务流程要求为客户提供解决方案 <br>2) 跟进/监控个案的后续发展，确保客户同步得到处理结果 <br>3) 处理客户抱怨或投诉，并按流程要求进行个案升级，安抚客户 <br>4) 分析问题， 解决问题", "job_num": "本科及以上；", "job_need": "1、全日制本科及以上学历，精算、统计、数学、金融、保险等相关专业优先；<br> 2、具备良好的人际沟通、组织协调能力和团队合作精神；<br>3、具备较强的责任感、上进心与抗压力；<br>35、具有创新意识与能力", "job_address": "深圳市" },
    { "job_name": "核保管理22", "job_duty": "1) 接收客户线上需求，并根据业务流程要求为客户提供解决方案 <br>2) 跟进/监控个案的后续发展，确保客户同步得到处理结果 <br>3) 处理客户抱怨或投诉，并按流程要求进行个案升级，安抚客户 <br>4) 分析问题， 解决问题", "job_num": "本科及以上；", "job_need": "1、全日制本科及以上学历，精算、统计、数学、金融、保险等相关专业优先；<br> 2、具备良好的人际沟通、组织协调能力和团队合作精神；<br>3、具备较强的责任感、上进心与抗压力；<br>36、具有创新意识与能力", "job_address": "深圳市" },
    { "job_name": "核保管理23", "job_duty": "1) 接收客户线上需求，并根据业务流程要求为客户提供解决方案 <br>2) 跟进/监控个案的后续发展，确保客户同步得到处理结果 <br>3) 处理客户抱怨或投诉，并按流程要求进行个案升级，安抚客户 <br>4) 分析问题， 解决问题", "job_num": "本科及以上；", "job_need": "1、全日制本科及以上学历，精算、统计、数学、金融、保险等相关专业优先；<br> 2、具备良好的人际沟通、组织协调能力和团队合作精神；<br>3、具备较强的责任感、上进心与抗压力；<br>37、具有创新意识与能力", "job_address": "深圳市" },
    { "job_name": "核保管理24", "job_duty": "1) 接收客户线上需求，并根据业务流程要求为客户提供解决方案 <br>2) 跟进/监控个案的后续发展，确保客户同步得到处理结果 <br>3) 处理客户抱怨或投诉，并按流程要求进行个案升级，安抚客户 <br>4) 分析问题， 解决问题", "job_num": "本科及以上；", "job_need": "1、全日制本科及以上学历，精算、统计、数学、金融、保险等相关专业优先；<br> 2、具备良好的人际沟通、组织协调能力和团队合作精神；<br>3、具备较强的责任感、上进心与抗压力；<br>38、具有创新意识与能力", "job_address": "深圳市" },
    { "job_name": "核保管理25", "job_duty": "1) 接收客户线上需求，并根据业务流程要求为客户提供解决方案 <br>2) 跟进/监控个案的后续发展，确保客户同步得到处理结果 <br>3) 处理客户抱怨或投诉，并按流程要求进行个案升级，安抚客户 <br>4) 分析问题， 解决问题", "job_num": "本科及以上；", "job_need": "1、全日制本科及以上学历，精算、统计、数学、金融、保险等相关专业优先；<br> 2、具备良好的人际沟通、组织协调能力和团队合作精神；<br>3、具备较强的责任感、上进心与抗压力；<br>39、具有创新意识与能力", "job_address": "深圳市" },
    { "job_name": "核保管理26", "job_duty": "1) 接收客户线上需求，并根据业务流程要求为客户提供解决方案 <br>2) 跟进/监控个案的后续发展，确保客户同步得到处理结果 <br>3) 处理客户抱怨或投诉，并按流程要求进行个案升级，安抚客户 <br>4) 分析问题， 解决问题", "job_num": "本科及以上；", "job_need": "1、全日制本科及以上学历，精算、统计、数学、金融、保险等相关专业优先；<br> 2、具备良好的人际沟通、组织协调能力和团队合作精神；<br>3、具备较强的责任感、上进心与抗压力；<br>40、具有创新意识与能力", "job_address": "深圳市" },
    { "job_name": "核保管理27", "job_duty": "1) 接收客户线上需求，并根据业务流程要求为客户提供解决方案 <br>2) 跟进/监控个案的后续发展，确保客户同步得到处理结果 <br>3) 处理客户抱怨或投诉，并按流程要求进行个案升级，安抚客户 <br>4) 分析问题， 解决问题", "job_num": "本科及以上；", "job_need": "1、全日制本科及以上学历，精算、统计、数学、金融、保险等相关专业优先；<br> 2、具备良好的人际沟通、组织协调能力和团队合作精神；<br>3、具备较强的责任感、上进心与抗压力；<br>41、具有创新意识与能力", "job_address": "深圳市" },
    { "job_name": "核保管理28", "job_duty": "1) 接收客户线上需求，并根据业务流程要求为客户提供解决方案 <br>2) 跟进/监控个案的后续发展，确保客户同步得到处理结果 <br>3) 处理客户抱怨或投诉，并按流程要求进行个案升级，安抚客户 <br>4) 分析问题， 解决问题", "job_num": "本科及以上；", "job_need": "1、全日制本科及以上学历，精算、统计、数学、金融、保险等相关专业优先；<br> 2、具备良好的人际沟通、组织协调能力和团队合作精神；<br>3、具备较强的责任感、上进心与抗压力；<br>42、具有创新意识与能力", "job_address": "深圳市" },
    { "job_name": "核保管理29", "job_duty": "1) 接收客户线上需求，并根据业务流程要求为客户提供解决方案 <br>2) 跟进/监控个案的后续发展，确保客户同步得到处理结果 <br>3) 处理客户抱怨或投诉，并按流程要求进行个案升级，安抚客户 <br>4) 分析问题， 解决问题", "job_num": "本科及以上；", "job_need": "1、全日制本科及以上学历，精算、统计、数学、金融、保险等相关专业优先；<br> 2、具备良好的人际沟通、组织协调能力和团队合作精神；<br>3、具备较强的责任感、上进心与抗压力；<br>43、具有创新意识与能力", "job_address": "深圳市" },
    { "job_name": "核保管理30", "job_duty": "1) 接收客户线上需求，并根据业务流程要求为客户提供解决方案 <br>2) 跟进/监控个案的后续发展，确保客户同步得到处理结果 <br>3) 处理客户抱怨或投诉，并按流程要求进行个案升级，安抚客户 <br>4) 分析问题， 解决问题", "job_num": "本科及以上；", "job_need": "1、全日制本科及以上学历，精算、统计、数学、金融、保险等相关专业优先；<br> 2、具备良好的人际沟通、组织协调能力和团队合作精神；<br>3、具备较强的责任感、上进心与抗压力；<br>44、具有创新意识与能力", "job_address": "深圳市" },
    { "job_name": "核保管理31", "job_duty": "1) 接收客户线上需求，并根据业务流程要求为客户提供解决方案 <br>2) 跟进/监控个案的后续发展，确保客户同步得到处理结果 <br>3) 处理客户抱怨或投诉，并按流程要求进行个案升级，安抚客户 <br>4) 分析问题， 解决问题", "job_num": "本科及以上；", "job_need": "1、全日制本科及以上学历，精算、统计、数学、金融、保险等相关专业优先；<br> 2、具备良好的人际沟通、组织协调能力和团队合作精神；<br>3、具备较强的责任感、上进心与抗压力；<br>45、具有创新意识与能力", "job_address": "深圳市" },
    { "job_name": "核保管理32", "job_duty": "1) 接收客户线上需求，并根据业务流程要求为客户提供解决方案 <br>2) 跟进/监控个案的后续发展，确保客户同步得到处理结果 <br>3) 处理客户抱怨或投诉，并按流程要求进行个案升级，安抚客户 <br>4) 分析问题， 解决问题", "job_num": "本科及以上；", "job_need": "1、全日制本科及以上学历，精算、统计、数学、金融、保险等相关专业优先；<br> 2、具备良好的人际沟通、组织协调能力和团队合作精神；<br>3、具备较强的责任感、上进心与抗压力；<br>46、具有创新意识与能力", "job_address": "深圳市" },
    { "job_name": "核保管理33", "job_duty": "1) 接收客户线上需求，并根据业务流程要求为客户提供解决方案 <br>2) 跟进/监控个案的后续发展，确保客户同步得到处理结果 <br>3) 处理客户抱怨或投诉，并按流程要求进行个案升级，安抚客户 <br>4) 分析问题， 解决问题", "job_num": "本科及以上；", "job_need": "1、全日制本科及以上学历，精算、统计、数学、金融、保险等相关专业优先；<br> 2、具备良好的人际沟通、组织协调能力和团队合作精神；<br>3、具备较强的责任感、上进心与抗压力；<br>47、具有创新意识与能力", "job_address": "深圳市" },
    { "job_name": "核保管理34", "job_duty": "1) 接收客户线上需求，并根据业务流程要求为客户提供解决方案 <br>2) 跟进/监控个案的后续发展，确保客户同步得到处理结果 <br>3) 处理客户抱怨或投诉，并按流程要求进行个案升级，安抚客户 <br>4) 分析问题， 解决问题", "job_num": "本科及以上；", "job_need": "1、全日制本科及以上学历，精算、统计、数学、金融、保险等相关专业优先；<br> 2、具备良好的人际沟通、组织协调能力和团队合作精神；<br>3、具备较强的责任感、上进心与抗压力；<br>48、具有创新意识与能力", "job_address": "深圳市" },
];


var job_list = [];
dataList.forEach(function (item) {
    if (job_list.indexOf(item.job_name) == -1) {
        job_list.push(item.job_name);
    }
})

var html = "";

job_list.forEach(function (item, index) {
    html += '<li s_id=' + index + ' >' + item + '</li>'
})

var allPage = Math.ceil(job_list.length / 9);

$(".allPage").text("0" + allPage);

$(".jobs_nav ul").html(html);

$(".jobs_nav ul li").click(function () {
    $(this).addClass("jobs_nav_active").siblings().removeClass("jobs_nav_active");
    var index = $(this).index() * 1;
    $(".duty_text").html(dataList[index].job_duty);
    $(".number_text").html(dataList[index].job_num);
    $(".need_text").html(dataList[index].job_need);
    $(".address_text").html(dataList[index].job_address);
    $(".scroll").scrollBar();
})

$(".jobs_nav ul li:first-child").trigger('click')

function init() {

    $(".jobs_nav ul li").each(function (index, item) {

        if ($(item).index() * 1 < 9) {

            $(item).show();

        } else {

            $(item).hide();

        }

    })

    sessionStorage.setItem("nowPage", "1");

    $(".jobs_nav ul li").eq(0).addClass("jobs_nav_active");
}

init();
// 箭头切换事件  下
$(".bottom_arrow").click(function () {
    // 上箭头可用
    $(".top_arrow").css("opacity", "1");

    // 获取当前页
    var num = (sessionStorage.getItem("nowPage") * 1) + 1;

    // 临界值判断
    if (num >= job_list.length / 9) {
        num = job_list.length / 9;
        $(".bottom_arrow").css("opacity", "0.5");
    }

    // 存储页码数
    sessionStorage.setItem("nowPage", num);

    $(".nowPages").text("0" + num);

    $(".jobs_nav ul li").each(function (index, item) {

        var id = $(item).index() * 1;

        if (id < num * 9 && id >= (num - 1) * 9) {

            $(item).show();

        } else {

            $(item).hide();

        }
    })

})
// 箭头切换事件  上

$(".top_arrow").click(function () {

    $(".bottom_arrow").css("opacity", "1");

    var num = (sessionStorage.getItem("nowPage") * 1) - 1;

    if (num <= 1) {
        num = 1;
        $(".top_arrow").css("opacity", "0.5");
    }

    sessionStorage.setItem("nowPage", num);

    $(".nowPages").text("0" + num);

    $(".jobs_nav ul li").each(function (index, item) {

        var id = $(item).index() * 1;

        if (id < num * 9 && id >= (num - 1) * 9) {

            $(item).show();

        } else {
            $(item).hide();
        }
    })

})

$(".jobs_detail").scrollBar();