var data = [
    {
        uname: '服务器运维工程师',
        place: '武汉-江夏区',
        duty: '1、 根据客户需求拟定slogan；<br />2、负责产品的创意策划、文案撰写及推进创意落地；<br />3、负责相关宣传物（网站、H5、线下物料、视频、宣传文案等）的创意策划与文案、脚本撰写及提案；<br />4、 掌握PPT进行方案包装；',
        qualifications: '1、专科及以上学历，新闻学、中文学、传播学、中文、广告学、平面设计等相关专业；<br />2、具备较扎实的文案策划功底，独立完成文案的撰写，有较强文案创意能力；<br />3、具备一定的审美能力，逻辑清晰，善于沟通；<br />4、责任心强，具备较强创新能力和团队合作精神；',
        link: '123'
    },
    {
        uname: '服务器运维工程师',
        place: '武汉-江夏区',
        duty: '1、 根据客户需求拟定slogan；<br />2、负责产品的创意策划、文案撰写及推进创意落地；<br />3、负责相关宣传物（网站、H5、线下物料、视频、宣传文案等）的创意策划与文案、脚本撰写及提案；<br />4、 掌握PPT进行方案包装；',
        qualifications: '1、专科及以上学历，新闻学、中文学、传播学、中文、广告学、平面设计等相关专业；<br />2、具备较扎实的文案策划功底，独立完成文案的撰写，有较强文案创意能力；<br />3、具备一定的审美能力，逻辑清晰，善于沟通；<br />4、责任心强，具备较强创新能力和团队合作精神；',
        link: '456'
    },
    {
        uname: '服务器运维工程师',
        place: '武汉-江夏区',
        duty: '1、 根据客户需求拟定slogan；<br />2、负责产品的创意策划、文案撰写及推进创意落地；<br />3、负责相关宣传物（网站、H5、线下物料、视频、宣传文案等）的创意策划与文案、脚本撰写及提案；<br />4、 掌握PPT进行方案包装；',
        qualifications: '1、专科及以上学历，新闻学、中文学、传播学、中文、广告学、平面设计等相关专业；<br />2、具备较扎实的文案策划功底，独立完成文案的撰写，有较强文案创意能力；<br />3、具备一定的审美能力，逻辑清晰，善于沟通；<br />4、责任心强，具备较强创新能力和团队合作精神；',
        link: '789'
    },
    {
        uname: '服务器运维工程师',
        place: '武汉-江夏区',
        duty: '1、 根据客户需求拟定slogan；<br />2、负责产品的创意策划、文案撰写及推进创意落地；<br />3、负责相关宣传物（网站、H5、线下物料、视频、宣传文案等）的创意策划与文案、脚本撰写及提案；<br />4、 掌握PPT进行方案包装；',
        qualifications: '1、专科及以上学历，新闻学、中文学、传播学、中文、广告学、平面设计等相关专业；<br />2、具备较扎实的文案策划功底，独立完成文案的撰写，有较强文案创意能力；<br />3、具备一定的审美能力，逻辑清晰，善于沟通；<br />4、责任心强，具备较强创新能力和团队合作精神；',
        link: '1234'
    },
    {
        uname: '服务器运维工程师',
        place: '武汉-江夏区',
        duty: '1、 根据客户需求拟定slogan；<br />2、负责产品的创意策划、文案撰写及推进创意落地；<br />3、负责相关宣传物（网站、H5、线下物料、视频、宣传文案等）的创意策划与文案、脚本撰写及提案；<br />4、 掌握PPT进行方案包装；',
        qualifications: '1、专科及以上学历，新闻学、中文学、传播学、中文、广告学、平面设计等相关专业；<br />2、具备较扎实的文案策划功底，独立完成文案的撰写，有较强文案创意能力；<br />3、具备一定的审美能力，逻辑清晰，善于沟通；<br />4、责任心强，具备较强创新能力和团队合作精神；',
        link: '12355'
    },
    {
        uname: '服务器运维工程师',
        place: '武汉-江夏区',
        duty: '1、 根据客户需求拟定slogan；<br />2、负责产品的创意策划、文案撰写及推进创意落地；<br />3、负责相关宣传物（网站、H5、线下物料、视频、宣传文案等）的创意策划与文案、脚本撰写及提案；<br />4、 掌握PPT进行方案包装；',
        qualifications: '1、专科及以上学历，新闻学、中文学、传播学、中文、广告学、平面设计等相关专业；<br />2、具备较扎实的文案策划功底，独立完成文案的撰写，有较强文案创意能力；<br />3、具备一定的审美能力，逻辑清晰，善于沟通；<br />4、责任心强，具备较强创新能力和团队合作精神；',
        link: '6346'
    },
   
]

var mySchool = [
    {
        uname:'中国人民大学1',
        src:'./images/x1.png',
        date:'9月15日  14:00-15:00',
        time:'就业中心421报告厅'
    },
    {
        uname: '中国人民大学2',
        src: './images/x1.png',
        date: '9月15日  14:00-15:00',
        time: '就业中心421报告厅'
    },
    {
        uname: '中国人民大学3',
        src: './images/x1.png',
        date: '9月15日  14:00-15:00',
        time: '就业中心421报告厅'
    },
    {
        uname: '中国人民大学4',
        src: './images/x1.png',
        date: '9月15日  14:00-15:00',
        time: '就业中心421报告厅'
    },
    {
        uname: '中国人民大学5',
        src: './images/x1.png',
        date: '9月15日  14:00-15:00',
        time: '就业中心421报告厅'
    },
    {
        uname: '中国人民大学6',
        src: './images/x1.png',
        date: '9月15日  14:00-15:00',
        time: '就业中心421报告厅'
    },
    

]