$(function(){
    var data = [
        {
            uname: '质量工程师',
            place: '上海',
            number: '2人',
            link: '21452123',
            info: '<b>专业要求：</b><br />机械设计及其自动化、工业工程、电气、热动、制冷等相关专业<br /><b>职位描述:</b><br />1、提升生产过程的质量指标并推动解决生产过程质量问题；<br />2、组织生产实施，保质保量完成生产工单，确保生产计划准时完成；<br />3、生产现场5S、作业标准化以及目视化管理，制定并实施一线生产人员的相关操作培训；<br />4、负责生产车间持续改进（CI）项目提升。<br /><b>职位要求:</b><br />1、硕士学历，2019年应届硕士毕业生或具备1 - 2年相关经验的往届生。机械设计及其自动化、工业工程、电气、热动、制冷等相关专业，对生产管理有浓厚兴趣；<br />2、愿意深入一线车间，善于沟通交流，有责任有担当，不怕面对困难和问题，勇于解决问题；<br />3、善于思考和发现，运用创新的方法发现问题、解决问题；<br />4、主动沟通，乐于交流，懂得协调利用资源并且有很强的学习能力、适应能力。'
        },
        {
            uname: '质量工程师',
            place: '上海',
            number: '2人',
            link: '21452123',
            info: '<b>专业要求：</b><br />机械设计及其自动化、工业工程、电气、热动、制冷等相关专业<br /><b>职位描述:</b><br />1、提升生产过程的质量指标并推动解决生产过程质量问题；<br />2、组织生产实施，保质保量完成生产工单，确保生产计划准时完成；<br />3、生产现场5S、作业标准化以及目视化管理，制定并实施一线生产人员的相关操作培训；<br />4、负责生产车间持续改进（CI）项目提升。<br /><b>职位要求:</b><br />1、硕士学历，2019年应届硕士毕业生或具备1 - 2年相关经验的往届生。机械设计及其自动化、工业工程、电气、热动、制冷等相关专业，对生产管理有浓厚兴趣；<br />2、愿意深入一线车间，善于沟通交流，有责任有担当，不怕面对困难和问题，勇于解决问题；<br />3、善于思考和发现，运用创新的方法发现问题、解决问题；<br />4、主动沟通，乐于交流，懂得协调利用资源并且有很强的学习能力、适应能力。'
        },
        {
            uname: '质量工程师',
            place: '上海',
            number: '2人',
            link: '21452123',
            info: '<b>专业要求：</b><br />机械设计及其自动化、工业工程、电气、热动、制冷等相关专业<br /><b>职位描述:</b><br />1、提升生产过程的质量指标并推动解决生产过程质量问题；<br />2、组织生产实施，保质保量完成生产工单，确保生产计划准时完成；<br />3、生产现场5S、作业标准化以及目视化管理，制定并实施一线生产人员的相关操作培训；<br />4、负责生产车间持续改进（CI）项目提升。<br /><b>职位要求:</b><br />1、硕士学历，2019年应届硕士毕业生或具备1 - 2年相关经验的往届生。机械设计及其自动化、工业工程、电气、热动、制冷等相关专业，对生产管理有浓厚兴趣；<br />2、愿意深入一线车间，善于沟通交流，有责任有担当，不怕面对困难和问题，勇于解决问题；<br />3、善于思考和发现，运用创新的方法发现问题、解决问题；<br />4、主动沟通，乐于交流，懂得协调利用资源并且有很强的学习能力、适应能力。'
        },
        {
            uname: '质量工程师',
            place: '上海',
            number: '2人',
            link: '21452123',
            info: '<b>专业要求：</b><br />机械设计及其自动化、工业工程、电气、热动、制冷等相关专业<br /><b>职位描述:</b><br />1、提升生产过程的质量指标并推动解决生产过程质量问题；<br />2、组织生产实施，保质保量完成生产工单，确保生产计划准时完成；<br />3、生产现场5S、作业标准化以及目视化管理，制定并实施一线生产人员的相关操作培训；<br />4、负责生产车间持续改进（CI）项目提升。<br /><b>职位要求:</b><br />1、硕士学历，2019年应届硕士毕业生或具备1 - 2年相关经验的往届生。机械设计及其自动化、工业工程、电气、热动、制冷等相关专业，对生产管理有浓厚兴趣；<br />2、愿意深入一线车间，善于沟通交流，有责任有担当，不怕面对困难和问题，勇于解决问题；<br />3、善于思考和发现，运用创新的方法发现问题、解决问题；<br />4、主动沟通，乐于交流，懂得协调利用资源并且有很强的学习能力、适应能力。'
        },
        {
            uname: '质量工程师',
            place: '上海',
            number: '2人',
            link: '21452123',
            info: '<b>专业要求：</b><br />机械设计及其自动化、工业工程、电气、热动、制冷等相关专业<br /><b>职位描述:</b><br />1、提升生产过程的质量指标并推动解决生产过程质量问题；<br />2、组织生产实施，保质保量完成生产工单，确保生产计划准时完成；<br />3、生产现场5S、作业标准化以及目视化管理，制定并实施一线生产人员的相关操作培训；<br />4、负责生产车间持续改进（CI）项目提升。<br /><b>职位要求:</b><br />1、硕士学历，2019年应届硕士毕业生或具备1 - 2年相关经验的往届生。机械设计及其自动化、工业工程、电气、热动、制冷等相关专业，对生产管理有浓厚兴趣；<br />2、愿意深入一线车间，善于沟通交流，有责任有担当，不怕面对困难和问题，勇于解决问题；<br />3、善于思考和发现，运用创新的方法发现问题、解决问题；<br />4、主动沟通，乐于交流，懂得协调利用资源并且有很强的学习能力、适应能力。'
        },
        {
            uname: '质量工程师',
            place: '上海',
            number: '2人',
            link: '21452123',
            info: '<b>专业要求：</b><br />机械设计及其自动化、工业工程、电气、热动、制冷等相关专业<br /><b>职位描述:</b><br />1、提升生产过程的质量指标并推动解决生产过程质量问题；<br />2、组织生产实施，保质保量完成生产工单，确保生产计划准时完成；<br />3、生产现场5S、作业标准化以及目视化管理，制定并实施一线生产人员的相关操作培训；<br />4、负责生产车间持续改进（CI）项目提升。<br /><b>职位要求:</b><br />1、硕士学历，2019年应届硕士毕业生或具备1 - 2年相关经验的往届生。机械设计及其自动化、工业工程、电气、热动、制冷等相关专业，对生产管理有浓厚兴趣；<br />2、愿意深入一线车间，善于沟通交流，有责任有担当，不怕面对困难和问题，勇于解决问题；<br />3、善于思考和发现，运用创新的方法发现问题、解决问题；<br />4、主动沟通，乐于交流，懂得协调利用资源并且有很强的学习能力、适应能力。'
        },
    ]
    // 轮播图
    var swiper1 = new Swiper('.swiper1', {
        loop: true, // 循环模式选项
        observer: true,
        observeParents: true,
        autoplay: {
            delay: 3000,
            stopOnLastSlide: false,
            disableOnInteraction: false,
        },
        // 如果需要分页器
        pagination: {
            el: '.swp1',
        },

        // 如果需要前进后退按钮
        navigation: {
            nextEl: '.next1',
            prevEl: '.prev1',
        },
    })
    var html = ''
    //循环数据
    $(data).each(function () {
        html += '<li>'
        html += '<span>' + this.uname + '</span>'
        html += '<span>' + this.place + '</span>'
        html += '<span>' + this.number + '</span>'
        html += '<span><a href="http://campus.51job.com/all/' + this.link + '.html">点击申请</a></span>'
        html += '</li>'
        html += '<li><p>' + this.info + '</p></li>'
    })
    // 渲染数据
    $('.tel').html(html)
    $('.tel li').eq(0).addClass('act')
    // 给职位添加点击事件
    $('.tel li:even').click(function () {
        // console.log($(this).attr('class'))
        $(this).next().stop().slideToggle()
        if ($(this).attr('class') != 'act') {
            $(this).addClass('act');
        } else {
            $(this).removeClass('act')
        }
        setTimeout(function () {
            console.log(1)
            // 刷新页面高度
            scroll.refresh();
        }, 500);
    })
})